УТ_для_edt/src/Documents/смартASP_ВводЗнаний/смартASP_ВводЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_ВводЗнаний</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>InformationRegister.смартASP_ТаблицаЗнаний</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаЗнаний</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.смартASP_Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартASP_ТаблицаЗнаний/смартASP_ТаблицаЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_ТаблицаЗнаний</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Балл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.смартASP_Категории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_ВводЗнаний/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаНаличияТекущихИнженеровВДругихДокументахВводаВПределахДня(Отказ);
	
	Если НЕ Отказ Тогда

		//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
		Если смартСтатусРасчетаБонусов <> Перечисления.смартСтатусыДокументовРасчетаБонусов.РасчетЗавершен Тогда
			Движения.смартASP_ТаблицаЗнаний.Очистить();
			Движения.смартASP_ТаблицаЗнаний.Записывать = Истина;
			Возврат;
		КонецЕсли;	
		//--#1288 смарт: Лопато 26.12.2022
		
		Запрос = Новый Запрос;
    	Запрос.Текст = 
        "ВЫБРАТЬ
        |	смартASP_ВводЗнаний.Дата КАК Дата
        |ИЗ
        |	Документ.смартASP_ВводЗнаний КАК смартASP_ВводЗнаний
        |ГДЕ
        |	смартASP_ВводЗнаний.Проведен = ИСТИНА
		|	И НАЧАЛОПЕРИОДА(смартASP_ВводЗнаний.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
        |	И смартASP_ВводЗнаний.Ссылка <> &Ссылка";
		
		Движения.смартASP_ТаблицаЗнаний.Очистить();
		Движения.смартASP_ТаблицаЗнаний.Записывать = Истина;
		
		Для Каждого стр Из ТаблицаЗнаний Цикл
			
			//++ #Б2508 смарт: Шляпников 26.02.2025 / Отчет "Анализ таблицы знаний". Показывать все категории для пользователя.
			// ЗАКОММЕНТИРОВАЛ СОГЛАСНО ЗАДАЧЕ
			//++ #1688 смарт: Шляпников 19.12.2024 / Доработка блока "Ввод знаний". Активность категорий знаний
			//Если стр.Балл = 0 Тогда
			//	Продолжить;
			//КонецЕсли;
			//-- #1688 смарт: Шляпников 19.12.2024
			//-- #Б2508 смарт: Шляпников 26.02.2025
			
			Запись = Движения.смартASP_ТаблицаЗнаний.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, стр);
			Запись.Период = Дата
			
		КонецЦикла
		
	КонецЕсли
	
КонецПроцедуры

//++#1288 смарт: Лопато 20.01.2023 //Правка ошибки, при которой удаляются данные ТЧ при записи не из формы  
////доработка внешней компании Асиситпро по проекту Бонусы инженеров
//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	//++ смарт:Каратеев #без номер 16.12.2022 //добавлено для загрузки обменом
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	//-- смарт:Каратеев #без номер 16.12.2022 //добавлено для загрузки обменом
//	Если НЕ Отказ Тогда
//		
//		ТаблицаЗнаний.Очистить();
//		
//		тзТабЗнаний = Неопределено;
//		Если ДополнительныеСвойства.Свойство("ТаблицаЗнаний", тзТабЗнаний) Тогда
//			Для Каждого стр Из тзТабЗнаний Цикл
//				Для Каждого кол Из тзТабЗнаний.Колонки Цикл
//					Если кол.Имя = "Инженер" Тогда
//						Продолжить;
//					КонецЕсли;
//					
//					нов = ТаблицаЗнаний.Добавить();
//					нов.Инженер = стр.Инженер;
//					нов.Категория = Справочники.смартASP_Категории.НайтиПоНаименованию(кол.Заголовок);
//					нов.Балл = стр[кол.Имя]
//				КонецЦикла;
//			КонецЦикла;	
//		КонецЕсли
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//--#1288 смарт: Лопато 20.01.2023

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ПроверкаНаличияТекущихИнженеровВДругихДокументахВводаВПределахДня(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ASP_ВводЗнанийТаблицаЗнаний.Инженер КАК Инженер
		|ПОМЕСТИТЬ ВТ_Инженеры
		|ИЗ
		|	Документ.смартASP_ВводЗнаний.ТаблицаЗнаний КАК ASP_ВводЗнанийТаблицаЗнаний
		|ГДЕ
		|	ASP_ВводЗнанийТаблицаЗнаний.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Инженеры.Инженер КАК Инженер
		|ИЗ
		|	ВТ_Инженеры КАК ВТ_Инженеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартASP_ВводЗнаний.ТаблицаЗнаний КАК ASP_ВводЗнанийТаблицаЗнаний
		|		ПО ВТ_Инженеры.Инженер = ASP_ВводЗнанийТаблицаЗнаний.Инженер
		|ГДЕ
		|	ASP_ВводЗнанийТаблицаЗнаний.Ссылка.Проведен
		|	И НЕ ASP_ВводЗнанийТаблицаЗнаний.Ссылка.ПометкаУдаления
		|	И ASP_ВводЗнанийТаблицаЗнаний.Ссылка <> &Ссылка
		|	И НАЧАЛОПЕРИОДА(ASP_ВводЗнанийТаблицаЗнаний.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		
		Выборка = РезультатЗапроса.Выбрать();	
		Пока Выборка.Следующий() Цикл
			Сообщение.Текст = "Есть документ по инженеру " + Выборка.Инженер + " за " + Формат(Дата, "ДФ='dd MMMM yyyy ""г.""'") + "!";
			Сообщение.Сообщить();
		КонецЦикла;
		
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
Процедура ПриКопировании(ОбъектКопирования)
	к = ТаблицаЗнаний.Количество();
	Пока к > 0 Цикл
		к = к-1;
		стр = ТаблицаЗнаний[к];
		Если НЕ стр.Категория.Активен ИЛИ стр.Категория.ПометкаУдаления Тогда
			ТаблицаЗнаний.Удалить(стр)
		КонецЕсли;
	КонецЦикла;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров  	

	смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	
КонецПроцедуры //--#1288 смарт: Лопато 29.12.2022

#КонецЕсли
